In [1]:
import psycopg2
import random
import sys
import pandas as pd

TABLE_LENGTH = 20
barr_mudalator = 1

if TABLE_LENGTH / 100 > 0:
    barr_mudalator = TABLE_LENGTH / 100

In [2]:
connection = psycopg2.connect(dbname='db_057', user='db_057', host='sci-didattica.unitn.it', password='pass_057')
cursor = connection.cursor()

In [96]:
connection.close()

In [15]:
print(connection)
print(cursor)

<connection object at 0x7f7db7689500; dsn: 'user=db_057 password=xxx dbname=db_057 host=sci-didattica.unitn.it', closed: 0>
<cursor object at 0x7f7dcd47b400; closed: 0>

1. Fa il drop delle due tabelle dalla base di dati se sono già presenti

In [74]:
cursor.execute('DROP TABLE IF EXISTS "Boat";')
connection.commit()
cursor.execute('DROP TABLE IF EXISTS "Sailor";')
connection.commit()

2. Crea le due tabelle come descritto sopra.

In [78]:
cursor.execute('CREATE TABLE "Sailor" ("id" INT PRIMARY KEY, "name" CHAR(50) NOT NULL, "address" CHAR(50) NOT NULL, "age" INT NOT NULL, "level" FLOAT NOT NULL);')
connection.commit()
cursor.execute('CREATE TABLE "Boat" ("bid" CHAR(25) PRIMARY KEY, "bname" CHAR(50) NOT NULL, "size" CHAR(30) NOT NULL, "captain" INT NOT NULL REFERENCES "Sailor"("id"));')
connection.commit()

3. Genera 1 milione di tuple (casuali1 ), in modo tale che ogni tupla abbia un valore diverso per l’attributo level, e
      le inserisce nella tabella S  ailor. Assicurarsi inoltre che l’ultima tupla inserita, e solo quella, abbia come valore
      dell’attributo level, il valore 185.

In [79]:
level = random.sample(range(186, 3000000), TABLE_LENGTH-1)
level.append(185)
name = ["Liam", "Olivia", "Noah", "Emma", "Oliver", "Ava", "William", "Sophia", "Elijah", "Isabella", "James", "Charlotte", "Benjamin", "Amelia", "Lucas", "Mia", "Mason", "Harper", "Ethan", "Evelyn"]
name_list = []
for i in range(0,TABLE_LENGTH,1):
    name_list.append(random.randint(0,19))

andress = "via Giangiorgio Oliviero,15"
age = 42

# setup toolbar
print('Load data in "Sailor"')
print("[", end ="")
for i in range(0,TABLE_LENGTH,1): 
    temp = f'''INSERT INTO "Sailor" ("id", "name", "address", "age", "level") VALUES ({i}, '{name[name_list[i]]}', '{andress}', {age}, {level[i]})'''
    cursor.execute(temp)
    connection.commit()
    if i % barr_mudalator == 0:
        print("-", end = "")

print("]")

Load data in "Sailor"
[-]

4. Genera 1 ulteriore milione di tuple (casuali) e le inserisce nella tabella B  oat.

In [80]:
bname = ["ABBEY", "ABBIE", "ABBY", "ABEL", "ABIGAIL", "ACE", "ADAM", "ADDIE", "ADMIRAL", "AGGIE", "AIRES", "AJ", "AJAX", "ALDO", "ALEX", "ALEXUS", "ALF", "ALFIE","ALLIE", "ALLY"]
bname_list = []
for i in range(0,TABLE_LENGTH,1):
    bname_list.append(random.randint(0,2))

size = ["large", "medium", "small"]
size_list = []
for i in range(0,TABLE_LENGTH,1):
    size_list.append(random.randint(0,2))

captain_list = []
for i in range(0,TABLE_LENGTH,1):
    captain_list.append(random.randint(0,TABLE_LENGTH-1))
    
print('Load data in "Boat"')   
print("[", end ="")
for i in range(0,TABLE_LENGTH,1): 
    temp = f'''INSERT INTO "Boat" ("bid", "bname", "size", "captain") VALUES ({i}, '{bname[bname_list[i]]}', '{size[size_list[i]]}', {captain_list[i]})'''
    cursor.execute(temp)
    connection.commit()
    if i % barr_mudalator == 0:
        print("-", end = "")
    
print("]")

Load data in "Boat"
[-]

In [81]:
pd.read_sql('''SELECT * FROM "Sailor"''', connection)

,id,name,address,age,level
0,0,Olivia ...,"via Giangiorgio Oliviero,15 ...",42,520253.0
1,1,Charlotte ...,"via Giangiorgio Oliviero,15 ...",42,634136.0
2,2,Lucas ...,"via Giangiorgio Oliviero,15 ...",42,1811899.0
3,3,Olivia ...,"via Giangiorgio Oliviero,15 ...",42,1279617.0
4,4,Emma ...,"via Giangiorgio Oliviero,15 ...",42,953510.0
5,5,Benjamin ...,"via Giangiorgio Oliviero,15 ...",42,515277.0
6,6,William ...,"via Giangiorgio Oliviero,15 ...",42,2769141.0
7,7,Charlotte ...,"via Giangiorgio Oliviero,15 ...",42,325729.0
8,8,Lucas ...,"via Giangiorgio Oliviero,15 ...",42,2129143.0
9,9,Charlotte ...,"via Giangiorgio Oliviero,15 ...",42,1664093.0
10,10,Olivia ...,"via Giangiorgio Oliviero,15 ...",42,2155091.0
11,11,Charlotte ...,"via Giangiorgio Oliviero,15 ...",42,1385514.0
12,12,Sophia ...,"via Giangiorgio Oliviero,15 ...",42,1401403.0
13,13,James ...,"via Giangiorgio Oliviero,15 ...",42,2513322.0
14,14,William ...,"via Giangiorgio Oliviero,15 ...",42,2646921.0
15,15,Evelyn ...,"via Giangiorgio Oliviero,15 ...",42,2807298.0
16,16,Evelyn ...,"via Giangiorgio Oliviero,15 ...",42,345690.0
17,17,William ...,"via Giangiorgio Oliviero,15 ...",42,2303536.0
18,18,William ...,"via Giangiorgio Oliviero,15 ...",42,234276.0
19,19,Harper ...,"via Giangiorgio Oliviero,15 ...",42,185.0

5. Ottiene dal database tutti gli id ​ del milione di tuple della tabella Sailor e li stampa su stderr​ .

In [82]:
cursor.execute(""" SELECT id FROM "Sailor" """)
lista = cursor.fetchall()
print(lista, file=sys.stderr)

[(0,), (1,), (2,), (3,), (4,), (5,), (6,), (7,), (8,), (9,), (10,), (11,), (12,), (13,), (14,), (15,), (16,), (17,), (18,), (19,)]

6. Tutte le tuple con valore di level pari a 185 vengono modificate, cambiando il valore di level a 200 (la vostra
          query dovrà funzionare anche se la base di dati contiene più di una tupla con valore di level pari a 185).

In [83]:
cursor.execute('''UPDATE "Sailor" SET "level" = 200 WHERE "level" = 185''')
connection.commit()

7. Seleziona l’id e l’address di tutte le tuple della tabella Sailor che hanno valore di level pari a 200, e li stampa su stderr.

In [84]:
cursor.execute('''SELECT id, address FROM "Sailor" as sl WHERE "level" = 200''')
lista = cursor.fetchall()
print(lista, file=sys.stderr)

[(19, 'via Giangiorgio Oliviero,15                       ')]

8. Crea un indice B+tree sull’attributo level.

In [90]:
cursor.execute('DROP INDEX IF EXISTS "index_level";')
connection.commit()

In [91]:
cursor.execute('CREATE INDEX index_level ON "Sailor" ("level");')
connection.commit()

9. Ottiene dal database tutti gli id ​ del milione di tuple della tabella Sailor​ e li stampa su stderr​ .

In [92]:
cursor.execute(""" SELECT id FROM "Sailor" """)
lista = cursor.fetchall()
print(lista, file=sys.stderr)

[(0,), (1,), (2,), (3,), (4,), (5,), (6,), (7,), (8,), (9,), (10,), (11,), (12,), (13,), (14,), (15,), (16,), (17,), (18,), (19,)]

10. Tutte le tuple con valore di level pari a 200 vengono modificate, cambiando il valore di level a 210 (la vostra
       query dovrà funzionare anche se la base di dati contiene più di una tupla con valore di level pari a 200).

In [94]:
cursor.execute('''UPDATE "Sailor" SET "level" = 210 WHERE "level" = 200''')
connection.commit()

11. Seleziona l’id e l’address di tutte le tuple della tabella Sailor che hanno valore di level pari a 210, e li stampa su stderr.

In [95]:
cursor.execute('''SELECT id, address FROM "Sailor" as sl WHERE "level" = 210''')
lista = cursor.fetchall()
print(lista, file=sys.stderr)

[(19, 'via Giangiorgio Oliviero,15                       ')]

In [3]:
pd.read_sql('''SELECT * FROM "Sailor"''', connection)

,id,name,address,age,level
0,1706633,PJfOPfYLSiZg ...,bZDhGzmlqfOhsgTInzXHdHeedqYcJPEjhImkTxrcpQ ...,24,2224257.0
1,683520,XykstyoGDDPC ...,EdaTfnStYzYFPmGiTOhROdmekdgiYGFCBaTtAmcrKZ ...,51,2219069.0
2,1624179,XGRNRJzMcDma ...,gByexkHCCXafihtsRsiKDSgChxYxIqbFJmMZLiOzyS ...,29,589261.0
3,757779,CROcljgRdCge ...,BFcDgiHcnnxyKcGOtoFcPBYoJEKIpGJOMxrbXmGadX ...,43,506742.0
4,611464,CbimPMgCRCZy ...,FdOZjDMTMMGnFBYJDFKCrQTApPLCiMLPTXsxpZkQIt ...,60,2540225.0
...,...,...,...,...,...
995,2476668,JrhPJOSoTMjL ...,tJHxkfHLykkgqsAHGZOyLHMnBfcDkqKfQNTYJJtESY ...,16,2541643.0
996,2302466,IMJPcAHdqmyl ...,TteabfKlcyiDOCXfNpxnDRynZHYQAzLailFXoYhlsE ...,37,939836.0
997,33541,hHEhMFAOgGgY ...,tmdkaZxkijGocFKtDcqeHfpJPjSsDRYDbIncTCreCy ...,52,570021.0
998,1469562,JxlzoTHgkyof ...,LnpYRLOXllRiDXdFyilRQcADCEyzxpFhcOgCOfiMBe ...,42,2038252.0
999,2715883,IOGLpjmFOsYr ...,eJIdjMzilIsmqslRdAenkkblJOnbNhkKMOTyABsmgc ...,58,210.0

In [4]:
pd.read_sql('''SELECT * FROM "Boat"''', connection)

,bid,bname,size,captain
0,1706633,jxnPLHqGiQXa ...,2,365163
1,683520,PtpAYTnSkxgK ...,0,863423
2,1624179,QbeXIyyPLHXo ...,1,1112199
3,757779,mkhByzYhCihX ...,2,235970
4,611464,ALdGHHzNanzO ...,2,770718
...,...,...,...,...
995,2476668,kKQmJHpAsDDZ ...,1,50200
996,2302466,BsOiHjMFpsCX ...,1,831703
997,33541,yFEZYbrFkedC ...,2,2615976
998,1469562,MAhYoQfrCbJb ...,2,1627388
999,2715883,rOXKbLnYgLcK ...,1,443319